phil971-psr.org
#+title: PHIL 971 - The Principle of Sufficient Reason 
#+date: July 8, 2022
#+author: Colin McLear

*** DONE Week 5 – Leibniz II: Freedom & the PSR
    SCHEDULED: <2022-09-22 Thu>
   :PROPERTIES:
   :EXPORT_HUGO_TAGS:  contingency explanation freedom leibniz psr truth 
   :EXPORT_FILE_NAME: week5
   :END:

We continue our discussion of Leibniz this week by looking at how his theory of the complete determination of everything (i.e. that everything has a reason, ground, or explanation) and his view of freedom. 

- [[https://discord.com/channels/1006739669842673674/1020721875720081558][Discussion Thread]]
- [[id:20220917T161827.750074][Notes]] ([[file:static/materials/handouts/leibniz-freedom.pdf][PDF]])
- [[file:static/materials/handouts/week-5-handout.pdf][Handout]]

**** Readings 
- Leibniz:
   + On Contingency
   + The Source of Contingent Truths
   + Excerpts from the /Letters to Arnauld/
   + Letter to Coste on Freedom 
   + On Freedom
   + On Freedom & Possibility

All the Leibniz readings can be found [[https://www.dropbox.com/scl/fo/nh5h14mi5rfi96inm8u82/h?dl=0&rlkey=l9sfje6tc16hbk6fsv0hr7itv][here]].

**** Recommended 
+ Adams, /Leibniz/, ch. 1
+ Lin, “Rationalism and Necessitarianism”^*
+ Rutherford, "Leibniz's Principle of Intelligibility"
+ Newlands, "Leibniz and the Ground of Possibility"
  
All the recommended readings can be found [[https://www.dropbox.com/scl/fo/5opmkyrvv29tn92u8xlks/h?dl=0&rlkey=inro0fmje8vhl3vjehyyp8r97][here]]. 

