content/assignments/week5.md
+++
title = "Week 5 – Leibniz II: Freedom & the PSR"
publishDate = 2022-09-22T00:00:00-04:00
tags = ["contingency", "explanation", "freedom", "leibniz", "psr", "truth"]
draft = false
weight = -100
author = false
toc = false
type = "post"
+++

We continue our discussion of Leibniz this week by looking at how his theory of the complete determination of everything (i.e. that everything has a reason, ground, or explanation) and his view of freedom.


## Readings {#readings}

-   Leibniz:
    -   On Contingency
    -   The Source of Contingent Truths
    -   Excerpts from the _Letters to Arnauld_
    -   Letter to Coste on Freedom
    -   On Freedom
    -   On Freedom &amp; Possibility

All the Leibniz readings can be found [here](https://www.dropbox.com/scl/fo/nh5h14mi5rfi96inm8u82/h?dl=0&rlkey=l9sfje6tc16hbk6fsv0hr7itv).


## Recommended {#recommended}

-   Adams, _Leibniz_, ch. 1
-   Lin, “Rationalism and Necessitarianism”^\*
-   Rutherford, &ldquo;Leibniz&rsquo;s Principle of Intelligibility&rdquo;
-   Newlands, &ldquo;Leibniz and the Ground of Possibility&rdquo;

All the recommended readings can be found [here](https://www.dropbox.com/scl/fo/5opmkyrvv29tn92u8xlks/h?dl=0&rlkey=inro0fmje8vhl3vjehyyp8r97).
